"""
Задание 3.	Сформировать из введенного числа
обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
то надо вывести число 6843.
Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены
Используем операции % //. Операции взятия по индексу применять нельзя.
Решите через рекурсию. В задании нельзя применять циклы.
Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
Не забудьте проверить на числе, которое оканчивается на 0.
1230 -> 0321
"""


def number_reverse(number):
    if len(number) == 1:
        return number
    else:
        n = str(int(number) % 10)
        number = str(int(number) // 10)
        if n == 0:
            return number_reverse(number) + n
        else:
            return n + number_reverse(number)


number_input = input('Введите число: ')
print(number_reverse(number_input))
